Repository: 84000/data-translation-memory
Catalog: toh601-v3.tmx
Source language: bo
Languages: en

source: ཤེས་པས་ཐམས་ཅད་མཐར་ཕྱིན་པར་གྲུབ་པའི་མཆོད་རྟེན་ཞེས་བྱ་བའི་གཟུངས།
en: The Dhāraṇī for a Caitya

source: དཀོན་མཆོག་གསུམ་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to the Three Jewels.

source: །བཅོམ་ལྡན་འདས་རྡོ་རྗེ་འཛིན་པ་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to the Blessed One, Vajradhara.

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཆོས་ཐམས་ཅད་ཀྱི་ཚུལ་དང་། འདུལ་བ་དང་། རྣམ་པར་འཕྲུལ་པའི་གཟི་བརྗིད་ཀྱི་རྒྱལ་པོ་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to the blessed, thus-gone, worthy, perfect Buddha, the king with majestic power over the mode, discipline, and miraculous display of all things.

source: །ཕྱག་འཚལ་དུས་གསུམ་སངས་རྒྱས་ལ།
en: Homage to the buddhas of the three times!

source: །ཕྱག་འཚལ་དཀོན་མཆོག་གསུམ་དགེ་ལ།
en: Homage to the virtuous Three Jewels!

source: །མི་འཁྲུགས་པ་དང་འོད་དཔག་མེད། །སྤྱན་རས་གཟིགས་ལ་བདག་ཕྱག་འཚལ།
en: I pay homage to Akṣobhya, Amitābha, and Avalokiteśvara!

source: །རིགས་གསུམ་ལ་ཡང་ཕྱག་འཚལ་ལོ།
en: Homage to the three families!

source: །འདི་སྐད་བདག་གིས་ཐོས་པའི་དུས་གཅིག་ན།
en: Thus did I hear at one time.

source: བཅོམ་ལྡན་འདས་རྡོ་རྗེ་འཛིན་པ་ཆེན་པོ་རི་རབ་ཆེན་པོ་སྣ་ལྔ་ལས་གྲུབ་པ། གཞི་ཉིད་མཆོད་རྟེན་གྱི་རང་བཞིན་དུ་གནས་པའི་སྟེང་ན། རིན་པོ་ཆེ་སྣ་ཚོགས་པའི་ཁང་པ་དང་། ཚད་མེད་པའི་མཆོད་རྟེན་བཞི་དང་།
en: The Blessed One, the great Vajradhara, was dwelling in a great caitya with a central palace made of various precious substances surrounded by four immeasurable caityas. It sat atop a foundation that had the nature of a caitya and was made from the five kinds of materials from the great Mount Meru.

source: རང་བཞིན་གྱི་མཆོད་རྟེན་ཆེན་པོའི་གནས་ཡིན་པའི་ཕྱིར་རྩེ་མོའི་དབྱིངས་ཀྱང་མཆོད་རྟེན་དུ་གྱུར་པའི་གནས་ན་ལག་ན་རྡོ་རྗེ་དང་། འཇམ་དཔལ་དང་།
en: The nature of this great caitya was such that even the space above its summit had the quality of a caitya.

source: སྤྱན་རས་གཟིགས་དང་། བྱམས་པ་ལ་སོགས་པས་བཅུའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་དང་། ཚངས་པ་དང་། བརྒྱ་བྱིན་དང་། རྒྱལ་པོ་ཆེན་པོ་བཞི་ལ་སོགས་པ་གཙང་རིས་ཀྱི་མགོན་པོ་རྣམས་དང་ཐབས་ཅིག་ཏུ་བཞུགས་སོ།
en: He was dwelling there together with Vajrapāṇi, Mañjuśrī, Avalokiteśvara, Maitreya, and other bodhisattvas of the tenth level, as well as the protectors of the pure abodes, including Brahmā, Śakra, and the Four Great Kings.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དབུའི་གཙུག་ཏོར་དང་། ཐུགས་ཀའི་དཔལ་གྱི་བེའུ་ལ་སོགས་པ་རྣམས་ནས་འོད་ཟེར་ཁ་དོག་རྣམ་པ་སྣ་ཚོགས་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དྲུག་ཅུ་སྙེད་ཅིག་བཀྱེ་སྟེ།
en: Then, a total of sixty quintillion light rays of various colors were emitted from the Blessed One’s uṣṇīṣa, the śrīvatsa at his heart, and other places.

source: སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་གྲངས་མེད་པ་བསམ་གྱིས་མི་ཁྱབ་ཅིང་བརྗོད་ཀྱིས་མི་ལང་བ་ཐམས་ཅད་འོད་ཟེར་གྱི་སྣང་བ་ཆེན་པོས་ཏིལ་གྱི་གང་བུ་བཞིན་དུ་གང་ཞིང་ཁྱབ་པར་མཛད་པས་མཐའ་ཡས་པའི་སེམས་ཅན་ཐམས་ཅད་ལོང་བ་རྣམས་ཀྱིས་གཟུགས་མཐོང་བ་དང་། འོན་པ་རྣམས་ཀྱིས་སྒྲ་ཐོས་པ་དང་།
en: The great brilliance of these light rays pervaded all the incalculable, inconceivable, and inexpressible realms of the trichiliocosm, filling them like a heap of mustard seeds.

source: དིག་པ་རྣམས་ཀྱིས་སྨྲ་ཤེས་པ་དང་། ཐེང་པོ་རྣམས་དང་། ཞ་བོ་རྣམས་འགྲོ་ཞིང་ཡན་ལག་རངས་པ་དང་། ནད་པ་རྣམས་ནད་དང་བྲལ་བ་དང་། དམྱལ་བ་རྣམས་ཚེ་ཕྲི་ནས་རིམ་གྱིས་སྡུག་བསྔལ་ལས་ཐར་བ་དང་།
en: All those among the infinite number of beings who were blind could now see forms, those who were deaf could hear sounds, those who stuttered could speak clearly, those with a limp or who had trouble walking could walk, those who were paralyzed and those who were sick were freed from their illness, hell beings had their lifespans reduced and were gradually freed from their torment, and all beings gradually became contemplative.

source: གཞན་ཡང་འགྲོ་བ་སེམས་ཅན་རྣམས་རིམ་གྱིས་དྲན་པ་རྙེད་པར་བྱས་ནས། ནམ་མཁའི་ཁམས་ཐམས་ཅད་ཡིད་ཀྱི་མཆོད་རྟེན་ཆོས་ཀྱི་སྐུས་གང་ཞིང་རྒྱས་པར་བྱས་ཏེ།
en: The entire sky filled with dharmakāya mind-caityas, which grew in size.

source: འོད་ཟེར་དེ་དག་སླར་བཅོམ་ལྡན་འདས་ཀྱི་དབུའི་གཙུག་ཏུ་འདུས་པ་ལས་ཆོས་ཀྱི་སྐུའི་གཟུགས་བརྙན་དུ་གྱུར་ཏོ། །དེ་ནས་ལག་ན་རྡོ་རྗེ་ལ་སོགས་པའི་འཁོར་རྣམས་ངོ་མཚར་དུ་གྱུར་ནས་བཅོམ་ལྡན་འདས་ལ་བླ་རེ་དང་། རྒྱལ་མཚན་དང་། འཕན་དང་། གདུགས་དང་། རྔ་ཡབ་དང་།
en: The rays of light then reentered the Blessed One’s uṣṇīṣa, turning into a representation of the dharmakāya.

source: དྲིལ་བུ་དང་། དར་དཔྱངས་དང་། སྤོས་དང་། མེ་ཏོག་དང་། ཕྲེང་བ་དང་།
en: Vajrapāṇi and the rest of the entourage were astonished, and they worshiped the Blessed One with offerings of canopies, banners, flags, parasols, fly whisks, bells, silk scarves, incense, flowers, garlands, unguents, lamps, food, music, and the like.

source: བྱུག་པ་དང་། མར་མེ་དང་། བཤོས་དང་། རོལ་མོ་ལ་སོགས་པའི་མཆོད་པ་རྣམས་ཀྱིས་མཆོད་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་འགྲོ་བའི་མགོན་པོ་ཐུགས་རྗེ་ཆེན་པོ་དང་ལྡན་པས་མཆོད་རྟེན་བྱིན་གྱིས་བརླབ་པའི་ཆོ་ག་རིག་པ་ཆེན་མོ་བི་མ་ལ་ཨུཥྞཱི་ཥའི་གཟུངས་བཤད་དུ་གསོལ།
en: They asked the Blessed One, “Please, Blessed One, protector of beings who possesses great compassion, teach the vimaloṣṇīṣa dhāraṇī, the great spell used in the rite for blessing a caitya.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། མཆོད་རྟེན་བྱིན་གྱིས་བརླབ་པའི་ཆོ་ག་རིག་པ་ཆེན་མོ་བི་མ་ལ་ཨུཥྞཱི་ཥའི་གཟུངས་འདི་ནི། རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་གང་ལ་ལ་ཞིག་གིས་འཛིན་ཏམ། འཆང་ངམ། བྲིས་སམ།
en: The Blessed One replied, “Here is the vimaloṣṇīṣa dhāraṇī, the great spell used in the rite for blessing a caitya.

source: ཀློག་གམ། མིང་ཉན་པར་བྱེད་ན། དེ་མཚམས་མེད་པ་ལྔ་དང་། མི་དགེ་བ་བཅུ་དང་། སྡིག་པའི་ལས་ཅི་བྱས་པ་ཐམས་ཅད་མ་ལུས་པར་བྱང་བར་འགྱུར་རོ།
en: Any son or daughter of noble family who understands, upholds, writes, reads, or makes its title known will entirely purify the five acts with immediate retribution, the ten unwholesome deeds, and any other negative actions they have performed.

source: །བི་མ་ལ་ཨུཥྞཱི་ཥའི་རིག་པ་ཆེན་མོའི་མཆོད་རྟེན་བྱིན་གྱིས་བརླབ་པའི་ཆོ་ག་འདིའོ། །ཨོཾ་ཏྲཻ་ཡ་དྷཱེ་སརྦ་ཏ་ཐཱ་ག་ཏ་ཧྲྀ་ད་ཡ་གརྦྷེ། ཛྭ་ལ་དྷརྨ་དྷཱ་ཏུ་གརྦྷེ། སྃ་ཧ་ར་ཎ་ཨཱ་ཡུཿསྃ་ཤོ་དྷ་ཡ། པཱ་པྃ་སརྦ་ཏ་ཐཱ་ག་ཏ་ས་མནྟ་ཨུཥྞཱེཥ་བི་མ་ལེ་བི་ཤུདྡྷེ་སྭཱ་ཧཱ།
en: This is the vimaloṣṇīṣa, the great spell used in the rites for blessing a caitya: oṁ traiyadhve sarva­tathāgata­hṛdayagarbhe jvala dharmadhātu­garbhe saṃhāraṇa āyuḥ saṃśodhaya pāpaṃ sarva­tathāgata­samantoṣṇīṣavimale viśuddhe svāhā.

source: རིག་པ་ཆེན་མོ་འདི་གསུངས་མ་ཐག་ཏུ་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་མཆོད་རྟེན་གྱི་རང་བཞིན་དུ་འགྱུར་རོ།
en: Immediately after he spoke this great spell, all the realms of the world took on the nature of a caitya.

source: །རིག་པ་ཆེན་མོ་འདི་གྲོ་གའམ། རས་སམ་ཤིང་ཤུན་ལ་བྲིས་ཏེ་རྒྱལ་མཚན་གྱི་རྩེ་མོ་ལ་བཏགས་ན། ལྷ་དང་མི་ལ་སོགས་པ་ཐམས་ཅད་ཀྱིས་མཆོད་ཅིང་ཕྱག་བྱ་བ་དང་། བཀུར་སྟི་བྱ་བའི་འོས་སུ་འགྱུར་བ་དང་།
en: If this great spell is written on birch bark, cloth, or other tree bark and affixed to the top of a banner, the banner will become worthy of worship, one that is honored and venerated by all gods, humans, and the like.

source: རིག་པ་ཆེན་མོ་འདི་ལུས་སམ་མགུལ་དུ་ཐོགས་ན། དེ་ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་པ་ལ་སོགས་པ་རྣམས་ཀྱིས་སངས་རྒྱས་ཉིད་དུ་བལྟ་བར་འགྱུར་རོ། །བདག་ཉིད་རི་བྲག་གམ།
en: If this great spell is affixed to someone’s body or neck, gods, humans, asuras, and the like will see that person as a buddha.

source: ཚལ་ལམ། དགོན་པའམ། ས་ཕྱོགས་གང་དུ་འགྲོ་བའི་ཚེ་རིག་པ་ཆེན་མོ་འདི་བརྗོད་ན་རི་དང་ས་ཕྱོགས་ཐམས་ཅད་མཆོད་རྟེན་དང་འདྲ་བར་འགྱུར་རོ། །ཨོཾ་ཏྲཻ་ཡ་དྷྭེ་སརྦ་ཏ་ཐཱ་ག་ཏ་ཧྲྀ་ད་ཡ་གརྦྷེ། ཛྭ་ལ་དྷརྨ་དྷཱ་ཏུ་གརྦྷེ།
en: If one recites this great spell when traversing rugged mountains, forests, isolated places, or other landscapes, all those mountains and landscapes will be like a caitya.

source: སྃ་ཧ་ར་ཎ་ཨཱ་ཡུཿསྃ་ཤོ་དྷ་ཡ། པཱ་པྃ་སརྦ་ཏ་ཐཱ་ག་ཏ་ས་མནྟ་ཨུཥྞཱི་ཥ་བི་མ་ལེ་བི་ཤུདྡྷེ་མ་ཧཱ་བི་ར་ཛེ་ར་གམྦྷཱི་ར་སི། དྷརྨ་དྷཱ་ཏུ་གརྦྷེ། བི་བི་སཱར་ཨ་ཨ་ལཾ་སྭཱ་ཧཱ་ཞེས་བརྗོད་ན། ས་གཞི་ཐམས་ཅད་ཀྱང་མཆོད་རྟེན་གྱི་རང་བཞིན་དུ་འགྱུར་རོ། །བདག་ཉིད་ཆུའམ།
en: If one recites oṁ traiyadhve sarvatathāgatahṛdayagarbhe jvala dharmadhātu­garbhe saṃhāraṇa āyuḥ saṃśodhaya pāpaṃ sarva­tathāgata­samantoṣṇīṣavimale viśuddhe mahāvirajera gambhīrasi dharmadhātugarbhe vivisāra a a laṁ svāhā, the entire ground will take on the nature of a caitya.

source: ཆུ་བོའམ། མཚོའམ། རྒྱ་མཚོ་ལ་སོགས་པ་གང་ལ་རྒལ་བ་ན་ཡང་རིག་པ་ཆེན་མོའི་སྔགས་འདིས་བཏབ་ན་ཆུ་དེ་ཐམས་ཅད་ཀྱང་མཆོད་རྟེན་གྱི་རང་བཞིན་དུ་འགྱུར་རོ། །ཨོཾ་ཏྲཻ་ཡ་དྷྭེ་སརྦ་ཏ་ཐཱ་ག་ཏ་ཧྲྀ་ད་ཡ་གརྦྷེ། ཛྭ་ལ་དྷརྨ་དྷཱ་ཏ་གརྦྷེ། སྃ་ཧ་ར་ཎ་ཨཱ་ཡུཿསྃ་ཤོ་དྷ་ཡ། པཱ་པྃ་སརྦ་ཏ་ཐཱ་ག་ཏ་ས་མནྟ།
en: If one utters this great mantra spell when crossing any body of water—such as a river, lake, or ocean—all that water will take on the nature of a caitya.

source: བི་མ་ལ་ཨུ་ཥྞཱི་ཥ་བི་ཤུདྡྷེ། མ་ཧཱ་བི་ར་ཛེ་ར་གམྦྷཱི་ར་སི། དྷརྨ་དྷཱ་ཏུ་བི་བི་སཱ་ར་ཨ་མ་མ་ཀི་སྭཱ་ཧཱ། ཞེས་བརྗོད་ན། ཆུ་ཐམས་ཅད་ཀྱང་མཆོད་རྟེན་གྱི་རང་བཞིན་དུ་འགྱུར་རོ།
en: After reciting oṁ traiyadhve sarva­tathāgata­hṛdayagarbhe jvala dharmadhātu­garbhe saṃhāraṇa āyuḥ saṃśodhaya pāpaṃ sarva­tathāgata­samantoṣṇīṣavimale viśuddhe mahā­virajera gambhīrasi dharmadhātu­garbhe vivisāra a māmaki svāhā, all water will take on the nature of a caitya.

source: །གཞན་ཡང་བདག་ཉིད་ཀྱིས་ནམ་མཁའ་གང་ནས་གང་ཁྱབ་པར་རིག་པ་ཆེན་མོའི་སྔགས་འདི་བཏབ་ན། ནམ་མཁའ་ཐམས་ཅད་ཀྱང་མཆོད་རྟེན་གྱི་རང་བཞིན་དུ་འགྱུར་རོ། །ཨོཾ་ཏྲཻ་ཡ་དྷྭེ་སརྦ་ཏ་ཐཱ་ག་ཏ་ཧྲྀ་ད་ཡ་གརྦྷེ། ཛྭ་ལ་དྷརྨ་དྷཱ་ཏུ་གརྦྷེ། སྃ་ཧ་ར་ཎ། ཨཱ་ཡུཿསྃ་ཤོ་དྷ་ཡ། པཱ་པྃ་སརྦ་ཏ་ཐཱ་ག་ཏ་ས་མནྟ། བི་མ་ལ་ཨུཥྞཱི་ཥ་བི་ཤུདྡྷེ།
en: Additionally, when one casts this great spell in a way that pervades the whole of space, all of space will also take on the nature of a caitya.

source: མ་ཧཱ་བི་ར་ཛེ་ར་གམྦྷཱི་ར་སི། དྷརྨ་དྷཱ་ཏུ་བི་བི་སཱ་ར་ཨ་ཨ་ཨེ་ཁྃ་ཡ་སྭཱ་ཧཱ་ཞེས་བརྗོད་ན། ནམ་མཁའི་ཁམས་ཐམས་ཅད་མཆོད་རྟེན་གྱི་རང་བཞིན་དུ་འགྱུར་ཏེ། ཕྱག་བྱ་བ་དང་། བསྐོར་བ་བྱ་བ་དང་།
en: When reciting oṁ traiyadhve sarva­tathāgata­hṛdayagarbhe jvala dharmadhātu­garbhe saṃhāraṇa āyuḥ saṃśodhaya pāpaṃ sarva­tathāgata­samantoṣṇīṣavimale viśuddhe mahā­virajera gambhīrasi dharmadhātu vivisāra a a e khaṃ ya svāhā, all of space will take on the nature of a caitya and become worthy of veneration, circumambulation, and worship.

source: མཆོད་པ་བྱ་བའི་འོས་སུ་འགྱུར་རོ། །བི་མ་ལ་ཨུཥྞཱི་ཥའི་གཟུངས་འདི་བཟླས་ཏེ། འབྱུང་བ་ཆེན་པོ་ལྔ་པོ་གང་ལ་ཡང་མཆོད་རྟེན་བཏབ་ན་ཉོན་མོངས་པ་དང་། སྒྲིབ་པ་ཐམས་ཅད་དག་པར་འགྱུར་རོ།
en: If one recites the vimaloṣṇīṣa dhāraṇī when making caityas from any of the five great elements, it purifies all afflictions and obscurations.

source: །གཞན་ཡང་ས་དང་། ཤིང་དང་། རྡོ་དང་། འཇིམ་པ་དང་། འབི་འབི་གང་ཡང་རུང་བ་ལ་རིག་པའི་སྔགས་འདིས་བཏབ་སྟེ།
en: Moreover, when a caitya is made with materials such as earth, wood, rock, mud, or clay onto which this mantra spell has been cast, those materials will produce a caitya made of various precious substances.

source: མཆོད་རྟེན་བཏབ་ན་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་མཆོད་རྟེན་གྱི་རྒྱུར་འགྱུར་ཏེ། ཨོཾ་རཏྣ་ཙཻ་ཏྱེ་པཉྩ་ཡེ་བི་བི་སཱ་ར་སྭཱ་ཧཱ། ཞེས་བརྗོད་ནས་བའི་ལྕི་བ་ལ་སོགས་པས་བྱུགས་ན་ཐམས་ཅད་རིན་པོ་ཆེའི་མཆོད་རྟེན་གྱི་རྒྱུར་འགྱུར་རོ།
en: When oṁ ratnacaitye pañcaye vivisāra svāhā is recited, cow dung and similar materials can be applied to result in a caitya made of various precious substances.

source: །རིག་པ་ཆེན་མོའི་སྔགས་འདི་མ་བཏབ་ན། གང་ཞིག་གསེར་དང་། དངུལ་དང་། བཻཌཱུརྱ་ལ་སོགས་པ་རིན་པོ་ཆེ་སྣ་བདུན་ལས་མཆོད་རྟེན་བཞེངས་སུ་གསོལ་ཡང་རྡོ་དང་། ཤིང་དང་། ཁམ་པ་དང་འདྲ་བར་འགྱུར་རོ།
en: If this great spell is not cast, even if one intends to fashion a caitya from gold, silver, lapis lazuli, and the rest of the seven precious substances, it will be no different than one made of stone, wood, or clay.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Why?

source: དེ་ནི་འདི་ཉིད་རྫས་ཀྱི་རང་བཞིན་ལས་སྙིང་པོ་དང་གསང་སྔགས་བྱིན་གྱིས་བརླབས་པ་མ་བཞུགས་པའི་ཕྱིར་རོ།
en: Because the blessing of the mantra and essence mantra will not have entered the nature of these materials.

source: །རིག་པ་ཆེན་མོ་འདིས་བྱིན་གྱིས་བརླབས་ཏེ་བཏབ་ན། འབྱུང་བ་ཆེན་པོ་གང་ལ་མཆོད་རྟེན་བཏབ་ཀྱང་བསྐལ་པ་དཔག་ཏུ་མེད་པ་ཐམས་ཅད་ཀྱི་སྒྲིབ་པའི་དྲི་མ་དག་ནས། ཁྱིམ་བདག་གི་རིགས་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུར་སྐྱེས་ནས་ཕྱིར་མི་ལྡོག་པའི་ས་ཐོབ་པར་འགྱུར་རོ། །རིག་པ་ཆེན་པོ་འདིས་བྱིན་གྱིས་བརླབས་ཏེ།
en: When blessed with the great spell, however, even a caitya made from any of the five great elements will purify the stains of the obscurations from incalculable eons so that one will be born into a householder family as great as a sal tree and go on to obtain the stage of nonregression.

source: རྡོ་དང་། ཤིང་ལེབ་ལ་སོགས་པ་ལ་མཆོད་རྟེན་བཏབ་ན། དེ་གདོན་མི་ཟ་བར་བྲམ་ཟེའི་རིགས་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུར་སྐྱེས་ནས་ས་བཅུ་རིམ་གྱིས་བགྲོད་དེ། བཅུ་གཅིག་ཀུན་ཏུ་འོད་ཀྱིས་ཐོབ་པར་འགྱུར་རོ། །རིག་པ་ཆེན་མོ་འདིས་བྱིན་གྱིས་བརླབས་ཏེ།
en: If one makes a caitya from stone, wood planks, and the like after blessing them with this great spell, there is no doubt that one will be born into a brahmin family as great as a sal tree, gradually traverse the ten stages, and obtain the eleventh stage, Universal Light.

source: གསེར་དང་། དངུལ་དང་། བཻ་ཌཱུརྱ་ལ་སོགས་པ་ལ་མཆོད་རྟེན་བཏབ་ན། དེ་གདོན་མི་ཟ་བར་རྒྱལ་རིགས་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུར་སྐྱེས་ནས་རྡོ་རྗེ་འཛིན་པའི་ས་ཐོབ་པར་འགྱུར་རོ།
en: If one makes a caitya from gold, silver, lapis lazuli, and the like after blessing them with this great spell, there is no doubt that one will be born into a kṣatriya family as great as a sal tree and go on to obtain the stage of Vajradhara.

source: །གཞན་ཡང་རིག་པ་ཆེན་མོའི་སྔགས་འདིས་བཏབ་ན་མཆོད་རྟེན་གཅིག་བཏབ་ན་ཡང་བྱེ་བ་བཏབ་པར་འགྱུར་རོ།
en: Furthermore, if this great mantra spell is cast when making a single caitya, it will be as if ten million were made.

source: །རིག་པ་ཆེན་མོ་འདིས་མ་བཏབ་ན་བྱེ་བ་བཏབ་ཀྱང་གཅིག་དང་འདྲ་བར་འགྱུར་རོ།
en: If this great spell is not cast, even if ten million caityas are made it will be as if they are just one.

source: གོང་མ་བཞིན་ནོ།
en: The answer is the same as before.

source: །རིག་པ་ཆེན་མོ་དེའི་སྔགས་ནི་འདི་ཡིན་ཏེ། ཏདྱ་ཐཱ། སཱུཀྵྨེ། སཱུཀྵྨེ། ཤཱནྟེ་ཤཱནྟེ། ནིར་ཀུ་ལེ། ཡ་ཤོ་ཏེ་ཛོ། སརྦ་བུདྡྷེ།
en: The mantra for the great spell is tadyathā sūkṣme sūkṣme śānte śānte nirākule yaśo tejo sarvabuddhe adhiṣṭhāna adhiṣṭhite anumide svāhā.

source: ཨ་དྷིཥྛཱ་ན། ཨ་དྷིཥྛི་ཏེ། ཨ་ནུ་མི་དེ་སྭཱ་ཧཱ། འདིའི་ཆོ་ག་ནི་འདི་ཡིན་ཏེ། འཇིམ་པའི་གོང་བུ་ལ་ལན་ཉི་ཤུ་རྩ་གཅིག་བཟླས་བརྗོད་བྱས་ཏེ།
en: Its procedure is as follows: if one makes a single caitya from a lump of clay after reciting the spell over it twenty-one times, it will be as if ten million are made.

source: མཆོད་རྟེན་གཅིག་བཏབ་ན་བྱེ་བ་བཏབ་པར་འགྱུར་རོ། །བརྒྱ་བཏབ་པའི་གྲངས་དང་ཕན་ཡོན་ནི་འཕགས་པ་ཉན་ཐོས་ཀྱི་དགྲ་བཅོམ་པ་རྣམས་ཀྱིས་ཀྱང་བརྗོད་པར་མི་ནུས་སོ།
en: The corresponding amount and benefit of making a hundred cannot be expressed, even by the arhats among noble śrāvakas.

source: སྟོང་བཏབ་པའི་གྲངས་དང་ཕན་ཡོན་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱིས་ཀྱང་བརྗོད་པར་མི་ནུས་སོ།
en: The corresponding amount and benefit of making a thousand cannot be expressed, even by bodhisattvas.

source: །ཁྲི་བཏབ་པའི་གྲངས་དང་ཕན་ཡོན་ནི་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱིས་ཀྱང་བརྗོད་པར་མི་ནུས་སོ།
en: The corresponding amount and benefit of making ten thousand cannot be expressed, even by the tathāgatas.

source: །འབུམ་བཏབ་པའི་གྲངས་དང་ཕན་ཡོན་ནི་ཕྱོགས་བཅུ་དུས་གསུམ་གྱི་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱིས་ཀྱང་བརྗོད་པར་མི་ནུས་སོ།
en: The corresponding amount and benefit of making a hundred thousand cannot be expressed, even by the tathāgatas of the three times and ten directions.

source: །དེ་བས་ན་མཆོད་པའི་རྟེན་ལྔ་མན་ཆད་གདབ་པའི་མཆོད་པའི་ཆོ་གར་བྱ་བ་ནི་ཐོག་མར་མཆོད་རྟེན་བརྩིག་པའི་གནས་སམ། མཆོད་རྟེན་གྱི་འཇིམ་པའི་གནས་སམ།
en: For these reasons, one should perform the ritual offering, including the five supports for offering.

source: མཆོད་རྟེན་གྱི་འཇིམ་པའི་གནས་གང་ནས་བླངས་པའི་གནས་དེར་ས་བདག་བྱིན་གྱིས་བརླབ་ཅིང་ས་ལ་གནས་པའི་གདོན་བགེགས་བསམ་སྦྱོར་ངན་པ་མཆོད་རྟེན་དང་།
en: First, the local deities should be appeased at the site where the caityas will be made, where the clay for the caityas will be stored, and where the clay for the caityas will be excavated.

source: དགེ་བ་ལ་བར་ཆད་བྱེད་པ་རྣམས་མཚམས་གཅད་པར་བྱ་སྟེ།
en: Next, a boundary should be created to thwart any ill-intentioned obstructing spirits who live there and would disrupt the caitya and its virtue.

source: ཐིག་སྐུད་ལ་རིག་པ་ཆེན་མོའི་སྔགས་འདིས་གདབ་སྟེ། ཨོཾ་བཛྲ་སཱུ་ཏྲ་ཧཱུྃ་ཕཊ།
en: To infuse a thread with the mantra of this great spell, recite oṁ vajrasūtra hūṁ phaṭ while visualizing a thread to be a vajra thread.

source: ཅེས་བརྗོད་ནས་ཐིག་སྐུད་དེ་ཉིད་རྡོ་རྗེའི་སྐུད་པར་དམིགས་ནས་མཆོད་རྟེན་གྱིས་ཁྱོན་ཇི་ཙམ་རན་པ་དང་འཇིམ་པའི་ས་ཁྱོན་ཇི་ཙམ་རན་པ་ཐིག་གིས་ས་བཅད།
en: The area that encompasses the site for the caitya and the area that encompasses the site where the clay is located should be demarcated with the thread.

source: དེ་བཞིན་དུ་ས་བཅད་ནས་གཞི་དེ་ཉིད་མཆོད་རྟེན་གྱི་རྒྱུ་རིན་པོ་ཆེ་རྣམ་པ་སྣ་ཚོགས་པ་དང་འདྲ་བར་འགྱུར་རོ།
en: When the ground is demarcated in this way, the specific patch of ground will take on the qualities of the various precious substances that are used for a caitya.

source: །དེ་ནས་ས་དེ་ཉིད་ལ་སེང་ལྡེང་གི་ཕུར་བུ་སོར་བརྒྱད་པ་ལ་རིག་པ་ཆེན་མོའི་སྔགས་འདི་གདབ་པར་བྱ་སྟེ།
en: In the same space, one should next cast the great spell oṁ vajrakīli kīli kīlaya sarvaduṣṭam hūṁ phaṭ on a rosewood stake that is eight fingers long.

source: ཨོཾ་བཛྲ་ཀཱི་ལི་ཀཱི་ལི་ཀཱི་ལ་ཡ་སརྦ་དུཥྚ་ན་ཧཱུྃ་ཕཊ། ཅེས་བྱ་བ་འདི་ལན་བདུན་པ་ཟླས་ཏེ། རྡོ་རྗེ་ཕུར་བུར་དམིགས་ཏེ་དབུས་དང་གྲྭ་བཞི་ར་གདབ་བོ།
en: After reciting it seven times, one should visualize it as a vajra stake and plant one in the center and at the four corners of the demarcated area.

source: །དེ་བཞིན་དུ་བཏབ་ན་མི་དང་། མི་མ་ཡིན་པ་ལས་བསྲུང་བར་འགྱུར་རོ། །སྔོན་གྱི་ལས་ཀྱི་རྣམ་པར་སྨིན་པ་ནི་མ་གཏོགས་སོ།
en: If done in that way, one will be protected from all humans and nonhumans, unless their actions are the result of the ripening of previous karma.

source: །སེང་ལྡེང་གི་ཕུར་བུ་ནི་མཆོད་རྟེན་གྱི་འཇིམ་པའི་ས་ཇི་ཙམ་དགོས་པ་མ་བླངས་ཀྱི་བར་དུ་མི་དབྱུང་བར་གཞག་གོ།
en: The rosewood stake should remain in the ground where the clay for the caitya is located and should not be removed for any reason until the clay is taken.

source: །དེ་ནས་ཏིལ་དང་ཡུངས་ཀར་ལ་རིག་པ་ཆེན་མོའི་སྔགས་འདི་བརྗོད་པར་བྱ་སྟེ། ཨོཾ་ཨ་མྲྀ་ཏེ་ཧ་ན་ཧ་ན་ཧཱུྃ་ཕཊ།
en: After that, cast the spell oṁ amṛte hana hana hūṁ phaṭ on sesame seeds and white mustard seeds.

source: ཅེས་ལན་བདུན་བཟླས་ཏེ། སའི་ཕྱོགས་སུ་གཏོར་བས།
en: It should be recited seven times, and the seeds should be scattered over the site.

source: སའི་ཕྱོགས་དེ་ཉིད་ཀྱང་དེ་བཞིན་གཤེགས་པའི་བཞུགས་གནས་དཔག་ཏུ་མེད་པར་འགྱུར། དེ་ལྟར་ས་གཞི་དེ་བཞིན་གཤེགས་པའི་བཞུགས་གནས་སུ་བྱིན་གྱིས་བརླབས་ཏེ། བགེགས་ཀྱི་བསམ་སྦྱོར་ངན་པ་ལས་མཚམས་བཅད་དེ།
en: By doing so, this specific area will become the immeasurable seat of the tathāgatas.

source: སྤོས་དང་། མེ་ཏོག་དང་། གཏོར་མ་ལ་སོགས་པ་རྣམས་ཀྱིས་ཀྱང་ས་ཕྱོགས་དེ་ན་གནས་པའི་ལྷ་དང་། ཀླུ་དང་། ལྷ་མ་ཡིན་ལ་སོགས་པ་རྣམས་ལ་མཆོད་ཅིང་བསྔོས་ཏེ།
en: Once the area has been blessed as the seat of the tathāgatas, the boundary against ill-intentioned obstructing spirits should be set by offering incense, flowers, oblations, and the like to the devas, nāgas, and asuras who reside in the area and then dedicating the merit.

source: བིམ་ལ་ཨུཥྞཱི་ཥའི་གཟུངས་འདི་བཀླགས་ན། ས་ཕྱོགས་དེ་ཡང་ཤིན་ཏུ་བཀྲ་ཤིས་ཤིང་བྱིན་ཆགས་པར་འགྱུར་རོ།
en: The area will be auspicious and blessed after the vimaloṣṇīṣa dhāraṇī has been recited.

source: །དེ་ནས་མཆོད་རྟེན་གྱི་འཇིམ་པའི་ས་བརྐོ་བའི་ཚེ་རིག་པ་ཆེན་མོའི་སྔགས་འདི་བཟླས་ཏེ་བརྐོ་བར་བྱའོ།
en: Next, when digging up the clay for the caitya, one should dig while reciting oṁ vajra khana khana hūṁ phaṭ.

source: །ཨོཾ་བཛྲ་ཁ་ན་ཁ་ན་ཧཱུྃ་ཕཊ། ཅེས་བཟླས་ཤིང་ས་གཞི་དེ་ཉིད་རིན་པོ་ཆེ་སྣ་ལྔར་གྱུར་པར་དམིགས་ཏེ་བརྐོས་ན་དེ་བཞིན་གཤེགས་པའི་སྐུ་རྣམ་པར་དག་པའི་རྒྱུར་འགྱུར་རོ།
en: Digging while reciting this and visualizing the area as composed of the five precious substances will transform it into the pure body of the Tathāgata.

source: །དེ་ནས་ས་གཙང་མ་བླངས་པ་དེ་དག་གནས་གཙང་མ་གཅིག་ཏུ་བཞག་ནས་ས་བརྡུང་བའི་ཆོ་ག་ནི་ཐོ་བ་ལ་བདུད་རྩི་འཁྱིལ་པའི་ཕྱག་རྒྱ་རྡོ་རྗེ་རྩེ་གསུམ་པས་མནན་ཏེ། རིག་པ་ཆེན་མོའི་སྔགས་འདིས་བཏབ་སྟེ།
en: The clean earth that has been excavated should then be placed in a purified area, and the rite of pounding the earth should be performed. One should form the gesture of Amṛtakuṇḍalin over a mallet, press it with a three-pronged vajra, and cast the great spell vajramudgara ākoṭaya ākoṭaya hūṁ phaṭ while pounding the earth.

source: བརྡུང་ངོ་། །བཛྲ་མུངྒར་ཨཱ་ཀོ་ཊ་ཡ་ཨཱ་ཀོ་ཊ་ཡ་ཧཱུྃ་ཕཊ། ཅེས་ལན་བདུན་བཟླས་ཏེ། རྡོ་རྗེའི་ཐོ་བར་དམིགས་ཤིང་བརྡུངས་ན་ཉོན་མོངས་པ་དང་། བག་ཆགས་ཐམས་ཅད་མ་ལུས་པར་བྱང་ཞིང་བཅོམ་པར་འགྱུར་རོ།
en: After pounding the earth while reciting this seven times and visualizing the mallet as a vajra mallet, all afflictions and habitual tendencies will be purified and defeated.

source: །དེ་ནས་འཇིམ་པ་བརྫི་བ་ནི་སྤོས་ཆབ་ལ་བདུད་རྩི་འཁྱིལ་པའི་ཕྱག་རྒྱས་གཏུགས་ཏེ།
en: Next comes the kneading of the clay.

source: སྤོས་ཆུ་དེའི་ནང་དུ་ཡང་ཆོས་ཉིད་ཀྱི་ཡི་གེ་ཨ་ཞེས་བྱ་བ་དཀར་པོ་ལས་ཟླ་བའི་དཀྱིལ་འཁོར་འོད་དང་བཅས་པར་དམིགས་ཏེ་ཟླ་བའི་དཀྱིལ་འཁོར་གྱི་འོད་ཟེར་ཆེན་པོ་དེས་སྤོས་ཆུ་དེ་ཁྱབ་པར་གྱུར་ནས།
en: After touching scented water with the gesture of Amṛtakuṇḍalin, one should imagine the nature of reality as a white syllable a within the scented water. A bright moon disk appears from the syllable, shining with intense rays of light that pervade the scented water.

source: སྤོས་ཆུ་ཉིད་བདུད་རྩིའི་རང་བཞིན་དུ་གྱུར་པར་དམིགས་ནས་རིག་པ་ཆེན་མོའི་སྔགས་འདི་བརྗོད་པར་བྱའོ། །ཨོཾ་ཨ་མྲྀ་ཏེ་ཧཱུྃ་ཕཊ།
en: Imagining that the scented water has taken on the nature of nectar, recite the great spell oṁ amṛte hūṁ phaṭ.

source: ཅེས་བྱ་བ་ལན་བདུན་བཟླས་ཏེ་བྱིན་གྱིས་བརླབས་པས། དེ་ཉིད་ཀྱང་བདུད་རྩི་ཆེན་པོའི་ཆུ་རྒྱུན་དང་འདྲ་བར་འགྱུར་རོ།
en: After blessing it with seven recitations, the scented water will be like a stream of great nectar.

source: །དེ་ནས་འཇིམ་པ་བརྫི་བའི་སྔགས་ཆེན་མོ་འདི་བརྗོད་པར་བྱའོ། །ཨོཾ་བཛྲ་པྲ་མ་རྡ་ནཱ་ཡ་ཧཱུྃ་ཕཊ།
en: One should then recite the following great spell for kneading the clay: oṁ vajra pramardanaya hūṁ phaṭ.

source: ཅེས་ལན་བདུན་བརྗོད་དེ། འཇིམ་པ་དེ་ཉིད་དེ་བཞིན་གཤེགས་པའི་སྐུར་འགྱུར་རོ།
en: After reciting it seven times, the clay will become the body of the Tathāgata.

source: །དེ་ནས་འཇིམ་པ་དེ་ཉིད་དེ་བཞིན་གཤེགས་པའི་སྐུ་བསམ་གྱིས་མི་ཁྱབ་པར་བྱིན་གྱིས་བརླབ་པ་ནི་འཇིམ་པ་དེ་ཉིད་ལ་བདུད་རྩི་འཁྱིལ་པའི་ཕྱག་རྒྱ་བཅིངས་ཏེ། རིག་པ་ཆེན་མོའི་གཟུངས་འདི་བརྗོད་པར་བྱའོ། །ན་མོ་རཏྣ་ཏྲ་ཡཱ་ཡ། ཏདྱ་ཐཱ། སཱུཀྵྨེ་སཱུཀྵྨེ། ཤཱནྟེ་ཤཱནྟེ། དཱནྟེ་དཱནྟེ། ནི་རཱ་ཀུ་ལེ། ཡ་ཤོ་ཡ་ཤོ། བ་ཏི་ཏེ་ཛོ་ཤུདྡྷེ་བི་ཤུདྡྷེ། སརྦ་ཏ་ཐཱ་ག་ཏ་ཨ་དྷིཥྛཱ་ན།
en: Now that the clay has been blessed as the inconceivable body of the Tathāgata, one should form the gesture of Amṛtakuṇḍalin over it while reciting the following great spell: namo ratna­trayāya tadyathā sūkṣme sūkṣme śānte śānte dānte dānte nirākule yaśo yaśovati tejo śuddhe viśuddhe sarva­tathāgata adhiṣṭhāna adhiṣṭhite ā namaḥ te hite svāhā.

source: ཨ་དྷིཥྛི་ཏེ། ཨཱ་ན་མཿཏེ་ཧི་ཏེ་སྭཱ་ཧཱ། ཞེས་བདག་ཉིད་ཀྱིས་རིག་པ་ཆེན་མོ་འདི་ལན་བདུན་གསུམ་ཉི་ཤུ་རྩ་གཅིག་བཟླས་ཏེ། རིག་པ་ཆེན་མོའི་སྔགས་འདིས་བྱིན་གྱིས་བརླབས་ན་འཇིམ་པ་ཉིད་ལས་ཡེ་ཤེས་ཀྱི་འོད་ཟེར་སྣ་ལྔ་ཕྱོགས་བཅུར་འཕྲོས་པར་འགྱུར་རོ། །ཕྱོགས་བཅུར་འཕྲོས་ནས་ཀྱང་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོན་ཇི་ལྟར་འདུལ་བར་བྱས་པར་འགྱུར་རོ།
en: Once one has recited this great spell in three sets of seven, totaling twenty-one times, and blessed the clay with the great mantra spell, five kinds of wisdom-light rays will radiate from the clay into the ten directions and tame all beings as needed.

source: །འོད་ཟེར་དེ་དག་སླར་འདུས་པས་ཀྱང་འཇིམ་པ་ཉིད་རིན་པོ་ཆེ་སྣ་ལྔའི་རང་བཞིན་དུ་གྱུར་ནས། དེ་བཞིན་གཤེགས་པའི་སྐུ་བསམ་གྱིས་མི་ཁྱབ་པའི་རྒྱུ་རྐྱེན་དང་ལྡན་པར་འགྱུར་རོ།
en: The rays of light then return, causing the clay to take on the nature of the five precious substances and endowing it with the causes and conditions for the inconceivable body of the Tathāgata.

source: །དེ་ལྟར་ཡིད་ཀྱིས་ཀྱང་དམིགས་སོ།
en: This is what one should imagine.

source: །དེ་ནས་འབི་འབི་བྱེད་པའི་ཚེ་རིག་པ་ཆེན་མོ་འདི་བརྗོད་པར་བྱ་སྟེ། ཨོཾ་བཛྲ་ཨཱ་ཡུ་ཥེ་སྭཱ་ཧཱ། ཞེས་ལན་བདུན་བཟླས་ཏེ་བྱིན་གྱིས་བརླབས་ན།
en: The following great spell should then be recited seven times while preparing balls of clay: oṁ vajra āyuṣe svāhā.

source: འབི་འབི་ཉིད་ལས་ཡེ་ཤེས་ཀྱི་འོད་ཟེར་གྱི་སྤྲིན་གྱིས་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་མཐའ་ཡས་པར་འཕྲོས་ཤིང་ཁྱབ་སྟེ། འགྲོ་བ་མང་པོའི་དོན་བྱེད་པར་འགྱུར་རོ།
en: Once blessed in this way, clouds of wisdom-light rays will radiate from the clay balls, pervade the limitless realms of the ten directions, and fulfill the aims of many beings.
